In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

# pandas的数据结构介绍
## Series

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5,3], index = ['d', 'a', 'b', 'c'])

In [7]:
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'a', u'b', u'c'], dtype='object')

In [9]:
obj2['a']

7

In [10]:
obj2[['a', 'b', 'c']]

a    7
b   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
a    7
c    3
dtype: int64

In [12]:
obj2 * 2

d     8
a    14
b   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d      54.598150
a    1096.633158
b       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'g' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 15000, 'Utah': 5000}

In [17]:
obj3 = Series(sdata)

In [18]:
obj3

Ohio      35000
Oregon    15000
Texas     71000
Utah       5000
dtype: int64

In [19]:
states = ['California', 'Ohio', 'Texas', 'Oregon']

In [20]:
obj4 = Series(sdata, index = states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Texas         False
Oregon        False
dtype: bool

In [25]:
obj4.notnull()

California    False
Ohio           True
Texas          True
Oregon         True
dtype: bool

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         30000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'population'
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Texas         71000.0
Oregon        15000.0
Name: population, dtype: float64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [31]:
data = {'States': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'population': [1.5, 1.6, 3.6, 2.4, 2.7]}
frame = DataFrame(data)

In [32]:
frame

   States  population  year
0    Ohio         1.5  2000
1    Ohio         1.6  2001
2    Ohio         3.6  2002
3  Nevada         2.4  2001
4  Nevada         2.7  2002

In [33]:
DataFrame(data, columns = ['year', 'States', 'population'])

   year  States  population
0  2000    Ohio         1.5
1  2001    Ohio         1.6
2  2002    Ohio         3.6
3  2001  Nevada         2.4
4  2002  Nevada         2.7

In [34]:
frame2 = DataFrame(data, columns = ['year', 'States', 'population', 'debt'], index = ['One', 'Two', 'Three', 'Four', 'Five'])

In [35]:
frame2

       year  States  population debt
One    2000    Ohio         1.5  NaN
Two    2001    Ohio         1.6  NaN
Three  2002    Ohio         3.6  NaN
Four   2001  Nevada         2.4  NaN
Five   2002  Nevada         2.7  NaN

In [36]:
frame2.columns

Index([u'year', u'States', u'population', u'debt'], dtype='object')

In [37]:
frame2['States']

One        Ohio
Two        Ohio
Three      Ohio
Four     Nevada
Five     Nevada
Name: States, dtype: object

In [38]:
frame2.year

One      2000
Two      2001
Three    2002
Four     2001
Five     2002
Name: year, dtype: int64

In [39]:
frame2.ix['Three']

year          2002
States        Ohio
population     3.6
debt           NaN
Name: Three, dtype: object

In [40]:
frame2['debt'] = 16.5

In [41]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5  16.5
Two    2001    Ohio         1.6  16.5
Three  2002    Ohio         3.6  16.5
Four   2001  Nevada         2.4  16.5
Five   2002  Nevada         2.7  16.5

In [42]:
frame2['debt'] = np.arange(5.)

In [43]:
frame2

       year  States  population  debt
One    2000    Ohio         1.5   0.0
Two    2001    Ohio         1.6   1.0
Three  2002    Ohio         3.6   2.0
Four   2001  Nevada         2.4   3.0
Five   2002  Nevada         2.7   4.0

In [44]:
val = Series([-1.2, -1.5, -1.7], index = ['One', 'Three', 'Five'])

In [45]:
frame2['Val'] = val

In [46]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [47]:
frame2['Eastern'] = (frame2.States == 'Nevada')

In [48]:
frame2

       year  States  population  debt  Val Eastern
One    2000    Ohio         1.5   0.0 -1.2   False
Two    2001    Ohio         1.6   1.0  NaN   False
Three  2002    Ohio         3.6   2.0 -1.5   False
Four   2001  Nevada         2.4   3.0  NaN    True
Five   2002  Nevada         2.7   4.0 -1.7    True

In [49]:
del frame2['Eastern']

In [50]:
frame2

       year  States  population  debt  Val
One    2000    Ohio         1.5   0.0 -1.2
Two    2001    Ohio         1.6   1.0  NaN
Three  2002    Ohio         3.6   2.0 -1.5
Four   2001  Nevada         2.4   3.0  NaN
Five   2002  Nevada         2.7   4.0 -1.7

In [51]:
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
frame3 = DataFrame(pop)

In [53]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [55]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [56]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [57]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [58]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [59]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [60]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [61]:
frame2.values

array([[2000, 'Ohio', 1.5, 0.0, -1.2],
       [2001, 'Ohio', 1.6, 1.0, nan],
       [2002, 'Ohio', 3.6, 2.0, -1.5],
       [2001, 'Nevada', 2.4, 3.0, nan],
       [2002, 'Nevada', 2.7, 4.0, -1.7]], dtype=object)

## 索引对象

In [62]:
obj = Series(range(3), index = ['a', 'b', 'c'])

In [63]:
index = obj.index

In [64]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [65]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [66]:
#index[1] = 'd'

In [67]:
index = pd.Index(np.arange(3))

In [68]:
obj2 = Series([1.5, -2.5, 0], index = index)

In [69]:
obj2.index is index

True

In [70]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
'Ohio' in frame3.columns

True

In [72]:
2003 in frame3.index

False

# 基本功能
## 重新索引

In [73]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [74]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [75]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])

In [76]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [77]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [78]:
obj3 = Series(['Blue', 'Purple', 'Yellow'], index = [0, 2, 4])

In [79]:
obj3.reindex(range(6), method = 'ffill')

0      Blue
1      Blue
2    Purple
3    Purple
4    Yellow
5    Yellow
dtype: object

In [80]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [81]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [83]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [84]:
state = ['Texas', 'Calfornia', 'Utah']
frame.reindex(columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [85]:
frame.reindex(index = ['a', 'b', 'c', 'd'], method = 'ffill', columns = state)

   Texas  Calfornia  Utah
a      1        NaN   NaN
b      1        NaN   NaN
c      4        NaN   NaN
d      7        NaN   NaN

In [86]:
frame.ix[['a', 'b', 'c', 'd'], state]

   Texas  Calfornia  Utah
a    1.0        NaN   NaN
b    NaN        NaN   NaN
c    4.0        NaN   NaN
d    7.0        NaN   NaN

## 丢弃指定轴上的项

In [87]:
obj = Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [88]:
new_obj = obj.drop('c')

In [89]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj.drop(['a', 'e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [91]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns = ['one', 'two', 'three', 'four'])

In [92]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop(['Colorado', 'New York'])

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [94]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [95]:
data.drop(['one', 'two'], axis = 1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

## 索引，选取和过滤

In [96]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [97]:
obj['b']

1.0

In [98]:
obj[1]

1.0

In [99]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [100]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [101]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [102]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [103]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [104]:
obj['b':'d'] = 5

In [105]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [106]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                 columns = ['one', 'two', 'three', 'four'])

In [107]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [109]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [110]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [111]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [113]:
data[data < 5] = 0

In [114]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [116]:
data.ix[['Colorado', 'New York'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
New York    15   12   13

In [117]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [118]:
data.ix[: 'Colorado', 'two']

Ohio        0
Colorado    5
Name: two, dtype: int64

In [119]:
data.ix[data.three > 5, : 3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 算术运算和数据对齐

In [120]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [121]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [122]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'), index = ['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [123]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## 在算术方法中填充值

In [124]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns = list('abcde'))

In [125]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [126]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [128]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [129]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## DataFrame和Series之间的运算

In [130]:
arr = np.arange(12.).reshape((3, 4))

In [131]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [132]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [133]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [134]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), 
                  columns = list('bde'), 
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [135]:
series = frame.ix[0]

In [136]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [137]:
series2 = Series(range(3), index = ['b', 'e', 'f'])

In [138]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [139]:
series3 = frame['d']

In [140]:
frame.sub(series3, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# 函数应用和映射

In [141]:
frame = DataFrame(np.random.randn(4, 3), columns = list('bde'), 
                 index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [142]:
frame

               b         d         e
Utah    1.312565 -0.921752  0.577250
Ohio   -1.289773 -2.421787  1.184583
Texas  -0.520771 -1.738275  0.320643
Oregon -1.663166  0.711578 -1.668749

In [143]:
np.abs(frame)

               b         d         e
Utah    1.312565  0.921752  0.577250
Ohio    1.289773  2.421787  1.184583
Texas   0.520771  1.738275  0.320643
Oregon  1.663166  0.711578  1.668749

In [144]:
f = lambda x: x.max() - x.min()

In [145]:
frame.apply(f)

b    2.975731
d    3.133365
e    2.853332
dtype: float64

In [146]:
frame.apply(f, axis = 1)

Utah      2.234317
Ohio      3.606370
Texas     2.058917
Oregon    2.380327
dtype: float64

In [147]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

In [148]:
frame.apply(f)

            b         d         e
min -1.663166 -2.421787 -1.668749
max  1.312565  0.711578  1.184583

In [149]:
format = lambda x: '%.2f' % x

In [150]:
frame.applymap(format)

            b      d      e
Utah     1.31  -0.92   0.58
Ohio    -1.29  -2.42   1.18
Texas   -0.52  -1.74   0.32
Oregon  -1.66   0.71  -1.67

In [151]:
frame['e'].map(format)

Utah       0.58
Ohio       1.18
Texas      0.32
Oregon    -1.67
Name: e, dtype: object

## 排序和排名

In [152]:
obj = Series(range(4), index = ['d', 'a', 'b', 'c'])

In [153]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [154]:
frame = DataFrame(np.arange(8.).reshape((2, 4)), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [155]:
frame

         d    a    b    c
three  0.0  1.0  2.0  3.0
one    4.0  5.0  6.0  7.0

In [156]:
frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [157]:
frame.sort_index(axis = 1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [158]:
frame.sort_index(axis = 1, ascending = False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [159]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [160]:
obj.order()

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [161]:
frame = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})

In [162]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [163]:
frame.sort_index(by='b')

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [164]:
frame.sort_index(by = ['a', 'b'])

/home/yi/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [165]:
obj = Series([7,-5,7,4,2,0,4])

In [166]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [167]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [168]:
obj.rank(method = 'max', ascending = False)

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [169]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [170]:
frame.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## 带有重复值的轴索引

In [171]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [172]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [173]:
obj.index.is_unique

False

In [174]:
obj['a']

a    0
a    1
dtype: int64

In [175]:
obj['c']

4

In [176]:
df = DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])

In [177]:
df

          0         1         2
a -0.742217  1.909632  0.403319
a  0.205744 -0.746342 -0.108988
b  0.176832  0.045502 -0.410632
b  0.401643 -0.082118  1.486455

In [178]:
df.ix['b']

          0         1         2
b  0.176832  0.045502 -0.410632
b  0.401643 -0.082118  1.486455

## 汇总和计算描述统计

In [179]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index = ['a', 'b', 'c', 'd'],
              columns = ['one', 'two'])

In [180]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [181]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [182]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [183]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [184]:
df.idxmax()

one    b
two    d
dtype: object

In [185]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [186]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [187]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [188]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 相关系数和协方差

In [189]:
import pandas_datareader.data as web

In [192]:
all_data = dict()
for ticker in ['AAPL', 'IBM']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2014', '1/1/2015')
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [193]:
returns = price.pct_change()

In [194]:
returns

                AAPL       IBM
Date
2014-01-02       NaN       NaN
2014-01-03 -0.021966  0.005983
2014-01-06  0.005453 -0.003429
2014-01-07 -0.007152  0.019946
2014-01-08  0.006333 -0.009172
2014-01-09 -0.012770 -0.003139
2014-01-10 -0.006673 -0.000640
2014-01-13  0.005235 -0.016554
2014-01-14  0.019898  0.009557
2014-01-15  0.020077  0.009789
2014-01-16 -0.005580  0.005433
2014-01-17 -0.024502  0.007046
2014-01-21  0.015536 -0.008733
2014-01-22  0.004444 -0.032797
2014-01-23  0.008468  0.002634
2014-01-24 -0.018178 -0.016910
2014-01-27  0.008113 -0.009686
2014-01-28 -0.079927 -0.005902
2014-01-29 -0.011352 -0.002545
2014-01-30 -0.001937  0.005442
2014-01-31  0.001641 -0.003834
2014-02-03  0.001858 -0.021395
2014-02-04  0.014476 -0.000347
2014-02-05  0.007469  0.008100
2014-02-06  0.005829  0.007963
2014-02-07  0.013990  0.014771
2014-02-10  0.017915 -0.000621
2014-02-11  0.013176  0.014452
2014-02-12 -0.000075  0.003005
2014-02-13  0.015879  0.008877
...              ...       ...
2014-11-18  0.012984 -0.013828
2014-11-19 -0.006928 -0.002841
2014-11-20  0.014302 -0.004894
2014-11-21  0.001376  0.001743
2014-11-24  0.018546  0.007644
2014-11-25 -0.008682 -0.002405
2014-11-26  0.011905  0.001175
2014-11-28 -0.000588  0.001358
2014-12-01 -0.032456 -0.003885
2014-12-02 -0.003824  0.006995
2014-12-03  0.011341  0.011373
2014-12-04 -0.003795 -0.002857
2014-12-05 -0.004243 -0.004755
2014-12-08 -0.022609 -0.008636
2014-12-09  0.015303  0.006981
2014-12-10 -0.019015 -0.015216
2014-12-11 -0.002948  0.003489
2014-12-12 -0.016932 -0.035326
2014-12-15 -0.013670 -0.014931
2014-12-16 -0.013675 -0.010780
2014-12-17  0.024918  0.003434
2014-12-18  0.029613  0.037846
2014-12-19 -0.007723  0.005264
2014-12-22  0.010378  0.018485
2014-12-23 -0.003542  0.004955
2014-12-24 -0.004709 -0.002589
2014-12-26  0.017677  0.003213
2014-12-29 -0.000702 -0.011273
2014-12-30 -0.012203 -0.002866
2014-12-31 -0.019019  0.002437

[252 rows x 2 columns]

In [195]:
returns.tail()

                AAPL       IBM
Date
2014-12-24 -0.004709 -0.002589
2014-12-26  0.017677  0.003213
2014-12-29 -0.000702 -0.011273
2014-12-30 -0.012203 -0.002866
2014-12-31 -0.019019  0.002437

In [196]:
returns.IBM.corr(returns.AAPL)

0.17824684762190815

In [197]:
returns.corr()

          AAPL       IBM
AAPL  1.000000  0.178247
IBM   0.178247  1.000000

In [198]:
returns.cov()

          AAPL       IBM
AAPL  0.000186  0.000026
IBM   0.000026  0.000117

In [199]:
returns.corrwith(returns.IBM)

AAPL    0.178247
IBM     1.000000
dtype: float64

In [200]:
returns.corrwith(volume)

AAPL   -0.070174
IBM    -0.338985
dtype: float64